; domain
;; STRIPS domain of the Air-Cargo

(define (domain air-cargo)
  (:requirements :strips)
  (:predicates 
        (At ?c ?a)  ;  c is at airport
        (In ?c ?p) ;  c is in plane p
        (Cargo ?c) ; c is a cargo
        (Airport ?a) ; a is an airpot
        (Plane ?p) ; p is a plane
    	
    )

    ; Load cargo to plane
  (:action LOAD
    :parameters (?cargo ?plane ?airport)
    :precondition (and (At ?cargo ?airport) (At ?plane ?airport) (Cargo ?cargo) (Plane ?plane) (Airport ?airport))
    :effect  (and (not (At ?cargo ?airport)) (In ?cargo ?plane)))
    
	;unload cargo from plane
  (:action UNLOAD
    :parameters (?cargo ?plane ?airport)
    :precondition (and (In ?cargo ?plane) (At ?plane ?airport) (Cargo ?cargo) (Plane ?plane) (Airport ?airport))
    :effect  (and (At ?cargo ?airport) (not (In ?cargo ?plane))))

    ; Fly from one airport to another 
  (:action FLY
    :parameters (?plane ?from ?to)
    :precondition (and (At ?plane ?from) (Plane ?plane) (Airport ?from) (Airport ?to))
    :effect  (and (not (At ?plane ?from)) (At ?plane ?to)))

)

; problem
;; STRIPS Instance problem for the Air cargo transport

(define (problem pb1)
  (:domain air-cargo)
  (:objects C1 C2
    P1 P2
    SFO JFK)
  (:init
   ;; types
   (Cargo C1) (Cargo C2)
   (Plane P1) (Plane P2)
   (Airport SFO) (Airport JFK)

  ;; locations
  (At C1 SFO) (At C2 JFK) (At P1 SFO) (At P2 JFK))

  (:goal
   (and (At C1 JFK) (At C2 SFO))))

; plan
1. (load c2 p2 jfk)
   deleted: (at c2 jfk)
   added: (in c2 p2)
   goals met: 0 of 2
2. (fly p2 jfk sfo)
   deleted: (at p2 jfk)
   added: (at p2 sfo)
   goals met: 0 of 2
3. (unload c2 p2 sfo)
   deleted: (in c2 p2)
   added: (at c2 sfo)
   goals met: 1 of 2
4. (load c1 p2 sfo)
   deleted: (at c1 sfo)
   added: (in c1 p2)
   goals met: 1 of 2
5. (fly p2 sfo jfk)
   deleted: (at p2 sfo)
   added: (at p2 jfk)
   goals met: 1 of 2
6. (unload c1 p2 jfk)
   deleted: (in c1 p2)
   added: (at c1 jfk)
   goals met: 2 of 2
